= DbPedia =

SPARQL Endpoint: http://dbpedia.org/sparql

Prefixes:  dbpedia.prefixes
[[
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX dc: <http://purl.org/dc/elements/1.1/>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX dbpedia2: <http://dbpedia.org/property/>
PREFIX dbpedia: <http://dbpedia.org/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbc: <http://dbpedia.org/resource/Category:>
PREFIX : <http://dbpedia.org/resource/>
]]

== German musicians born in Berlin ==

Query: dbpedia-musicians.sparql
[[
SELECT ?name ?birth ?description ?person WHERE {
     ?person dbo:birthPlace :Berlin .
     ?person <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:German_musicians> .
     ?person dbo:birthDate ?birth .
     ?person foaf:name ?name .
     ?person rdfs:comment ?description .
     FILTER (LANG(?description) = 'en') .
     }
]]

ASQ command:

  asq -e http://dbpedia.org/sparql -p dbpedia.prefixes -q dbpedia-musicians.sparql 

Response:
[[
{"head": {"link": [], "vars": ["name", "birth", "description", "person"]}, "results": {"distinct": false, "bindings": [{"person": {"type": "uri", "value": "http://dbpedia.org/resource/Drafi_Deutscher"}, "name": {"xml:lang": "en", "type": "literal", "value": "Drafi Deutscher"}, "birth": {"datatype": "http://www.w3.org/2001/XMLSchema#date", "type": "typed-literal", "value": "1946-05-09"}, "description": {"xml:lang": "en", "type": "literal", "value": "Drafi Deutscher (9 May 1946 &ndash; 9 June 2006) was a German singer and composer."}}, {"person": {"type": "uri", "value": "http://dbpedia.org/resource/Renate_Blauel"}, "name": {"xml:lang": "en", "type": "literal", "value": "Renate Blauel"}, "birth": {"datatype": "http://www.w3.org/2001/XMLSchema#date", "type": "typed-literal", "value": "1953-03-01"}, "description": {"xml:lang": "en", "type": "literal", "value": "Renate Ruth Margot John (n\u00e9e Blauel; born 1 March 1953) is a German music engineer."}}, {"person": {"type": "uri", "value": "http://dbpedia.org/resource/Alexander_Marcus"}, "name": {"xml:lang": "en", "type": "literal", "value": "Alexander Marcus"}, "birth": {"datatype": "http://www.w3.org/2001/XMLSchema#date", "type": "typed-literal", "value": "1979-12-24"}, "description": {"xml:lang": "en", "type": "literal", "value": "Alexander Marcus (born 24 December 1979 in Berlin) is a persona of the German music producer Felix Rennefeld. He has become popular throughout Germany after a series of videos he produced and displayed on YouTube."}}, {"person": {"type": "uri", "value": "http://dbpedia.org/resource/Andy_Malecek"}, "name": {"xml:lang": "en", "type": "literal", "value": "Andy Malecek"}, "birth": {"datatype": "http://www.w3.org/2001/XMLSchema#date", "type": "typed-literal", "value": "1964-06-28"}, "description": {"xml:lang": "en", "type": "literal", "value": "Andy Malecek is a German guitarist who has played in the bands Fair Warning and Last Autumn's Dream."}}], "ordered": true}}
]]


== French films ==

Query:

  SELECT ?film WHERE { ?film scterms:subject dbc:French_films }

ASQ command:

  asq -e http://dbpedia.org/sparql -p dbpedia.prefixes "SELECT ?film WHERE { ?film dcterms:subject dbc:French_films } LIMIT 10"

Response:
[[
{"head": {"link": [], "vars": ["film"]}, "results": {"distinct": false, "bindings": [{"film": {"type": "uri", "value": "http://dbpedia.org/resource/Wings_of_Desire"}}, {"film": {"type": "uri", "value": "http://dbpedia.org/resource/Ararat_%28film%29"}}, {"film": {"type": "uri", "value": "http://dbpedia.org/resource/Three_Colors:_Blue"}}, {"film": {"type": "uri", "value": "http://dbpedia.org/resource/Orpheus_%28film%29"}}, {"film": {"type": "uri", "value": "http://dbpedia.org/resource/Ali_G_Indahouse"}}, {"film": {"type": "uri", "value": "http://dbpedia.org/resource/The_Discreet_Charm_of_the_Bourgeoisie"}}, {"film": {"type": "uri", "value": "http://dbpedia.org/resource/The_City_of_Lost_Children"}}, {"film": {"type": "uri", "value": "http://dbpedia.org/resource/Confidentially_Yours"}}, {"film": {"type": "uri", "value": "http://dbpedia.org/resource/Ma_vraie_vie_%C3%A0_Rouen"}}, {"film": {"type": "uri", "value": "http://dbpedia.org/resource/Beau_travail"}}], "ordered": true}}
]]

